In [2]:
import pandas as pd
from pandas import Series, DataFrame

In [3]:
s1 = Series([1,2,3], index= ['a','b','c'])
s1

a    1
b    2
c    3
dtype: int64

In [4]:
s1['a']=2
s1

a    2
b    2
c    3
dtype: int64

In [5]:
'b' in s1

True

In [6]:
data = {'a':1,'b':2}
index = ['a','c']
s1 = Series(data, index)
s1

a    1.0
c    NaN
dtype: float64

In [7]:
s2 = Series([1,2],index=['a','b'])
s1 + s2

a    2.0
b    NaN
c    NaN
dtype: float64

In [8]:
s1.name = 'test'

In [9]:
s1

a    1.0
c    NaN
Name: test, dtype: float64

In [10]:
df1 = DataFrame({'s1':s1,'s2':s2})
df1

    s1   s2
a  1.0  1.0
b  NaN  2.0
c  NaN  NaN

In [11]:
df1.s1

a    1.0
b    NaN
c    NaN
Name: s1, dtype: float64

In [12]:
del df1['s1']
df1

    s2
a  1.0
b  2.0
c  NaN

In [13]:
df1

    s2
a  1.0
b  2.0
c  NaN

In [14]:
df2 = DataFrame({'s1':Series([1,2],index=['a','b']),'s2':Series([1,2,3],index={'a','c','d'})})
df2

    s1   s2
a  1.0  1.0
b  2.0  NaN
c  NaN  2.0
d  NaN  3.0

In [15]:
df2.values

array([[ 1.,  1.],
       [ 2., nan],
       [nan,  2.],
       [nan,  3.]])

In [16]:
df2.reindex(['a','b','c','d','e'])

    s1   s2
a  1.0  1.0
b  2.0  NaN
c  NaN  2.0
d  NaN  3.0
e  NaN  NaN

In [17]:
df2.reindex(columns=['s1','s3'])

    s1  s3
a  1.0 NaN
b  2.0 NaN
c  NaN NaN
d  NaN NaN

In [18]:
df2.loc[:'b']

    s1   s2
a  1.0  1.0
b  2.0  NaN

In [19]:
df2

    s1   s2
a  1.0  1.0
b  2.0  NaN
c  NaN  2.0
d  NaN  3.0

In [20]:
df3 = DataFrame({'s1': Series([1,1,1],index=['b','c','d']),'s3':Series([1,2,1],index=['b','c','d'])})

In [21]:
df3

   s1  s3
b   1   1
c   1   2
d   1   1

In [22]:
df2 + df3

    s1  s2  s3
a  NaN NaN NaN
b  3.0 NaN NaN
c  NaN NaN NaN
d  NaN NaN NaN

In [23]:
df3.rdiv(1) # = 1/df3

    s1   s3
b  1.0  1.0
c  1.0  0.5
d  1.0  1.0

In [24]:
df2.add(df3, fill_value=0)

    s1   s2   s3
a  1.0  1.0  NaN
b  3.0  NaN  1.0
c  1.0  2.0  2.0
d  1.0  3.0  1.0

In [28]:
df2

    s1   s2
a  1.0  1.0
b  2.0  NaN
c  NaN  2.0
d  NaN  3.0

In [30]:
s2 = df2['s2']
s2

a    1.0
b    NaN
c    2.0
d    3.0
Name: s2, dtype: float64

In [31]:
df2.sub(s2,axis='index')

    s1   s2
a  0.0  0.0
b  NaN  NaN
c  NaN  0.0
d  NaN  0.0

In [32]:
formats = lambda x: '%.2f' % x
df2.applymap(formats)

     s1    s2
a  1.00  1.00
b  2.00   nan
c   nan  2.00
d   nan  3.00

In [34]:
s2.map(formats)

a    1.00
b     nan
c    2.00
d    3.00
Name: s2, dtype: object

In [36]:
s1 = pd.Series([7,-5,7,4,2,0,4])
s1.rank()#获得的数值是排名，但是量化过的排名。破坏平级关系。

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [37]:
s1.idxmax()

0

In [38]:
s1.cumsum()#累计求和

0     7
1     2
2     9
3    13
4    15
5    15
6    19
dtype: int64

In [44]:
df4 = (df2+df3).fillna(0)
df4

    s1   s2   s3
a  0.0  0.0  0.0
b  3.0  0.0  0.0
c  0.0  0.0  0.0
d  0.0  0.0  0.0

In [47]:
df4.corrwith(df4.s1)

s1    1.0
s2    NaN
s3    NaN
dtype: float64